app/controllers/admin/settings_controller.rb

  def index
    @preference = Preference.first_or_create(allow_create_artists: true, allow_create_songs: true)
---
INSERT INTO "preferences" ("allow_create_artists", "allow_create_songs", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["allow_create_artists", "t"], ["allow_create_songs", "t"], ["created_at", "2016-04-01 15:25:14.489075"], ["updated_at", "2016-04-01 15:25:14.489075"]]
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1

  def update
    @preference = Preference.find(params[:id])
    @preference.update(preference_params)
---
SELECT  "preferences".* FROM "preferences" WHERE "preferences"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "preferences" SET "artist_sort_order" = ?, "song_sort_order" = ?, "updated_at" = ? WHERE "preferences"."id" = ?  [["artist_sort_order", "DESC"], ["song_sort_order", "ASC"], ["updated_at", "2016-04-01 15:25:26.613455"], ["id", 1]]