app/controllers/artists_controller.rb

  def new
    pref = Preference.first
---
SELECT  "preferences".* FROM "preferences"  ORDER BY "preferences"."id" ASC LIMIT 1